In [21]:
Dict = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'] , 'last_name': ['Miller', 'Jacobson', '.', 'Milner','Cooze'],

'age': [42, 52, 36, 24, 73], 'preTestScore': [4, 24, 31, '.', '.'],'postTestScore': ["25,000", "94,000", 57, 62, 70]}

In [22]:
Dict

{'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
 'last_name': ['Miller', 'Jacobson', '.', 'Milner', 'Cooze'],
 'age': [42, 52, 36, 24, 73],
 'preTestScore': [4, 24, 31, '.', '.'],
 'postTestScore': ['25,000', '94,000', 57, 62, 70]}

In [23]:
Dict.keys()

dict_keys(['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])

In [24]:
Dict.values()

dict_values([['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], ['Miller', 'Jacobson', '.', 'Milner', 'Cooze'], [42, 52, 36, 24, 73], [4, 24, 31, '.', '.'], ['25,000', '94,000', 57, 62, 70]])

In [20]:
import pandas as pd

In [29]:
df = pd.DataFrame(data=Dict.values(), index=Dict.keys())

In [30]:
df

                    0         1     2       3      4
first_name      Jason     Molly  Tina    Jake    Amy
last_name      Miller  Jacobson     .  Milner  Cooze
age                42        52    36      24     73
preTestScore        4        24    31       .      .
postTestScore  25,000    94,000    57      62     70

In [32]:
df.transpose()

  first_name last_name age preTestScore postTestScore
0      Jason    Miller  42            4        25,000
1      Molly  Jacobson  52           24        94,000
2       Tina         .  36           31            57
3       Jake    Milner  24            .            62
4        Amy     Cooze  73            .            70

In [33]:
df.transpose().to_csv("project.csv")

In [34]:
df_new=pd.read_csv("project.csv")

In [36]:
df_new.drop('Unnamed: 0' , axis=1)

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [38]:
df_new.drop('Unnamed: 0' , axis=1).isna().sum()

first_name       0
last_name        0
age              0
preTestScore     0
postTestScore    0
dtype: int64

In [48]:
df_new.drop('Unnamed: 0' , axis=1)[0:3]

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57